---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.NoVisibleTargetsForCurrentConstraint
source: html/739781a6-d03e-e36c-17eb-f81c0744883a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.NoVisibleTargetsForCurrentConstraint Property

There are no visible constraint targets in the current view. Please switch to another view.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoVisibleTargetsForCurrentConstraint { get; }
```